using System;
using System.Collections.Generic;
using System.Text.RegularExpressions;

namespace AlgorithmsDataStructures2
{
    public class HeapAdd : Heap
    {
        public HeapAdd() { }

        //Задание 4. Добавьте метод поиска максимального элемента в заданном диапазоне значений.
        public int FindMaxInRange(int min, int max)
        {
            if (HeapArray == null || Count == 0) return default(int);
            return DoFindMaxInRange(0, min, max);
        }

        public int DoFindMaxInRange(int index, int min, int max)
        {
            if (index >= Count) return default(int);
            if (HeapArray[index] < min) return default(int);
            if (HeapArray[index] <= max) return HeapArray[index];
            if (HeapArray[index] > max)
            {
                int LeftChildMax = DoFindMaxInRange(2 * index + 1, min, max);
                int RightChildMax = DoFindMaxInRange(2 * index + 2, min, max);
                return Math.Max(LeftChildMax, RightChildMax);
            }
            return default(int);
        }

        /* Начинаем с корня, если корень меньше минимума, значит искомого в куче впринципе нет,
         * если корень входит в диапазон, значит это максимально возможное значение в куче.
         * Если элемент больше, значит нужно идти по детям и там искать наибольшее.
         * Сложность по времени O(n), в худшем случае если все элементы кучи больше, мы пройдем по всей куче.
         * Сложность по памяти O(1), ничего не создаем.
         */

        //Задание 5.  Подумайте над эффективным алгоритмом поиска в куче элемента по заданному условию (например, меньше заданного значения).
        /* В таком алгоритме, надо пользоваться свойством кучи, что дети всегда меньше или равны родителю. 
         * Например если ищем элемент меньше заданного значения, то мы когда поподаем на узел который подходит под условие,
         * значит все поддерево под этим узлом будет подходить под условие. Если нет, то нужно проверять детей и спускаться ниже.
         */

        //Задание 6. Добавьте метод объединения текущей кучи с кучей-параметром.
        public void UnionTwoHeaps(Heap SecondHeap)
        {
            if (HeapArray == null || SecondHeap == null) return;
            if (HeapArray.Length - Count < SecondHeap.Count) return;
            int SecondHeapCount = SecondHeap.Count;
            for (int i = 0; i < SecondHeapCount; i++) Add((SecondHeap.GetMax()));
        }
        /* Чтобы делалось через 1 метод во внешнем интерфейсе, появилось ограничение в объединении.
         * Мы не можем объединить кучи если в текущей нет места для второй, так-как чтобы увеличивать место,
         * надо менять метод Add, который должен следить за переполнением или же воздействовать на массив, 
         * что запрещено в задании. Поэтому сначала проверяем влезает ли вторая куча в первую, затем поочередно,
         * добаввляем элепменты через Add, благодаря этому свойства кучи после объединения сохраняются.
         * Сложность по времени O(nlogn), при взятии максимального элемента с второй кучи и при дорбавлении его в первую,
         * происходит 2 просеивания вниз и вверх.
         * Сложность по памяти O(1), ничего не создаем.
         */

        // Рекомендации по решению задач задания 5.

        /* Рефлексия по прошлому заданию. 2. Эффективность поиска узла в дереве, представленном в виде массива.
         * Думал, что все дело в индексах и работе компилятора через стек, а не через кучу. Оказывается,
         * надо смотреть на память.
         */

        /* Рефлексия по прошлому заданию. 3. Удаление узла из двоичного дерева, заданного в виде массива.
         * Сделал не как  эталоне, я всегда перестраивал дерево, не проверяя лист ли это, сколько потомков.
         * Теперь знаб, что нужно смотреть и тогда в некоторых случаях, не нужно будет перестраивать все дерево,
         * а достончно будет заменить значние листа на null или поменять местами с ребенком.
         */

        /* Рефлексия по прошлому заданию. 4. Сортировка двоичного дерева за O(1).
         * Тоже так подумал, что сбалансированное дерево по определению уже отсортированно.
         */
    }
}